src_doc/InformationRegisters/НастройкиНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нумераторы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНумерации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНумерации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нумеровать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияНумераторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/НастройкиНумерации/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Нумеровать = Нумерация.СформироватьПолеНумеровать(Запись.СпособНумерации, Запись.Нумератор);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Измерения = Метаданные.РегистрыСведений.НастройкиНумерации.Измерения;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ЗаполненныеИзмерения = Новый Массив;
		НезаполненныеИзмерения = Новый Массив;
		
		Для Каждого Измерение Из Измерения Цикл
			ИмяИзмерения = Измерение.Имя;
			
			Если (ИмяИзмерения = "Организация" И Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям"))
			 Или (ИмяИзмерения = "ВопросДеятельности" И Не ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности"))
			 Или (ИмяИзмерения = "Проект" И Не ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам"))
			 Или (ИмяИзмерения = "ГрифДоступа" И Не ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа")) Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Запись[ИмяИзмерения]) Тогда 
				ЗаполненныеИзмерения.Добавить(ИмяИзмерения);
			Иначе
				НезаполненныеИзмерения.Добавить(ИмяИзмерения);
			КонецЕсли;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиНумерации.ТипДокумента КАК ТипДокумента,
		|	НастройкиНумерации.ВидДокумента КАК ВидДокумента,
		|	НастройкиНумерации.Организация КАК Организация,
		|	НастройкиНумерации.Подразделение КАК Подразделение,
		|	НастройкиНумерации.ВопросДеятельности КАК ВопросДеятельности,
		|	НастройкиНумерации.Контрагент КАК Контрагент,
		|	НастройкиНумерации.Проект КАК Проект,
		|	НастройкиНумерации.СпособНумерации КАК СпособНумерации,
		|	НастройкиНумерации.Нумератор КАК Нумератор,
		|	НастройкиНумерации.Назначение КАК Назначение,
		|	НастройкиНумерации.Тематика КАК Тематика,

		|	НастройкиНумерации.ГрифДоступа
		|ИЗ
		|	РегистрСведений.НастройкиНумерации КАК НастройкиНумерации";
		
		НайденныеСтроки = Новый Массив;
		
		Результат = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из Результат Цикл
			
			ЕстьРазличия = Ложь;
			Для Каждого ЗаполненноеИзмерение Из ЗаполненныеИзмерения Цикл
				Если ЗначениеЗаполнено(Строка[ЗаполненноеИзмерение]) И 
					Строка[ЗаполненноеИзмерение] <> Запись[ЗаполненноеИзмерение] Тогда 
					ЕстьРазличия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			
			Если ЕстьРазличия Тогда 
				Продолжить;
			КонецЕсли;	
			
			Для Каждого ЗаполненноеИзмерение Из ЗаполненныеИзмерения Цикл
				Если Не ЗначениеЗаполнено(Строка[ЗаполненноеИзмерение]) Тогда 
					НайденныеСтроки.Добавить(Строка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;	
		
		Для Каждого НезаполненноеИзмерение Из НезаполненныеИзмерения Цикл
			Для Каждого Строка Из НайденныеСтроки Цикл
				Если ЗначениеЗаполнено(Строка[НезаполненноеИзмерение]) Тогда 
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Настройка ""%1"" приводит к возможности неоднозначного определения параметров нумерации с настройкой ""%2"".'"),
						ПредставлениеЗаписи(Запись),
						ПредставлениеЗаписи(Строка));
						ВызватьИсключение ТекстСообщения;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеЗаписи(Запись)
	
	ЗаполненныеИзмерения = Новый Массив;
	
	Измерения = Метаданные.РегистрыСведений.НастройкиНумерации.Измерения;
	Для Каждого Измерение Из Измерения Цикл
		ИмяИзмерения = Измерение.Имя;
		
		Если (ИмяИзмерения = "Организация" И Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям"))
			Или (ИмяИзмерения = "ВопросДеятельности" И Не ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности"))
			Или (ИмяИзмерения = "Проект" И Не ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам"))
			Или (ИмяИзмерения = "ГрифДоступа" И Не ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа")) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись[ИмяИзмерения]) Тогда 
			ЗаполненныеИзмерения.Добавить(ИмяИзмерения);
		КонецЕсли;	
	КонецЦикла;	
	
	Представление = "";
	Для Каждого ЗаполненноеИзмерение Из ЗаполненныеИзмерения Цикл
		Представление = Представление + Запись[ЗаполненноеИзмерение] + ", ";
	КонецЦикла;	
	Если Представление <> "" Тогда 
		Представление = Лев(Представление, СтрДлина(Представление)-2);
	КонецЕсли;	
	
	Возврат Представление;
	
КонецФункции

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
